# ExternalResourceService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..ExternalResourceService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service which permits registration of an alternate servers for managing external resources such as linked files.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId ExternalResourceService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExternalResourceService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ ExternalResourceService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace